Firewall.xml

$<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <ns1:AddPortMapping xmlns:ns1="urn:schemas-upnp-org:service:WANIPConnection:1">
      <NewRemoteHost></NewRemoteHost>
      <NewExternalPort>8080</NewExternalPort>
      <NewProtocol>TCP</NewProtocol>
      <NewInternalPort>80</NewInternalPort>
      <NewInternalClient>192.168.0.1</NewInternalClient>
      <NewEnabled>1</NewEnabled>
      <NewPortMappingDescription>Netcat_listening</NewPortMappingDescription>
      <NewLeaseDuration>0</NewLeaseDuration>
    </ns1:AddPortMapping>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
